Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 572, 572, 24 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 570, 570, 64) 13888       input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 568, 568, 64) 36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 284, 284, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 284, 284, 64) 256         max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 282, 282, 128 73856       batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 280, 280, 128 147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 140, 140, 128 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 140, 140, 128 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 140, 140, 128 512         dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 138, 138, 256 295168      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 136, 136, 256 590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 68, 68, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 68, 68, 256)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 68, 68, 256)  1024        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 66, 66, 512)  1180160     batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 512)  2359808     conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 32, 32, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 512)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 30, 30, 1024) 4719616     dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 28, 28, 1024) 9438208     conv2d_8[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 56, 56, 1024) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 56, 56, 512)  2097664     up_sampling2d[0][0]              
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 56, 56, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 56, 56, 1024) 0           conv2d_10[0][0]                  
                                                                 cropping2d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 56, 56, 1024) 4096        concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 54, 54, 512)  4719104     batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 52, 52, 512)  2359808     conv2d_11[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 52, 52, 512)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 104, 104, 512 0           dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 104, 104, 256 524544      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 104, 104, 256 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 104, 104, 512 0           conv2d_13[0][0]                  
                                                                 cropping2d_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 104, 104, 512 2048        concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 102, 102, 256 1179904     batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 100, 100, 256 590080      conv2d_14[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 100, 100, 256 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 200, 200, 256 0           dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 200, 200, 128 131200      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
cropping2d_2 (Cropping2D)       (None, 200, 200, 128 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 200, 200, 256 0           conv2d_16[0][0]                  
                                                                 cropping2d_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 200, 200, 256 1024        concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 198, 198, 128 295040      batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 196, 196, 128 147584      conv2d_17[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 196, 196, 128 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 392, 392, 128 0           dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 392, 392, 64) 32832       up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
cropping2d_3 (Cropping2D)       (None, 392, 392, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 392, 392, 128 0           conv2d_19[0][0]                  
                                                                 cropping2d_3[0][0]               
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 390, 390, 64) 73792       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 388, 388, 64) 36928       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 388, 388, 1)  65          conv2d_21[0][0]                  
==================================================================================================
Total params: 31,052,801
Trainable params: 31,048,321
Non-trainable params: 4,480
__________________________________________________________________________________________________